# PostgreSQL in Python

- Author: Jason Zeng
- Created on: `05/08/2023`

# Find connection details from your pgAdmin:
host=localhost port=5433 dbname=postgres user=postgres password=12345 sslmode=prefer

In [1]:
import psycopg2  # connect python and postgresql 
import pandas as pd  # read-in as pandas dataframe

DB_NAME = 'postgres'
DB_USER = 'postgres'
DB_PASS = '12345'
DB_HOST = 'localhost'
DB_PORT = '5433'

try:
    conn = psycopg2.connect(database = DB_NAME,
                     user = DB_USER,
                     host = DB_HOST,
                     password = DB_PASS,
                     port = DB_PORT
                    )
    print('Database connected successfully!')
except:
    print('I am unable to connect to the database')

Database connected successfully!

In [2]:
# check if table 'employee' exists
query = "SELECT to_regclass('public.employee')"
employee_table = pd.read_sql(query, conn)

if employee_table.iloc[0,0] == None:
    print("Table 'employee' does not exist in the database")
else:
    # If the table exists, drop it
    print("Dropping table 'employee'")
    cur = conn.cursor()
    cur.execute("DROP TABLE employee")
    conn.commit()
    cur.close()

Dropping table 'employee'

In [3]:
# List all table names in the db

sql_query = '''
    SELECT table_name 
    FROM information_schema.tables
    WHERE table_schema='public'
    ORDER BY table_name
'''

data = pd.read_sql_query(sql_query, conn)
data.head()

  table_name
0  customers

## 1. Create a New table using Python

In [4]:
cur = conn.cursor()   # create a cursor named cur

# execute query to create a table
cur.execute("""
CREATE TABLE employee
(
    ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    EMAIL TEXT NOT NULL
)
"""
)

# commit the changes
conn.commit()
print('Table created successfully')

Table created successfully

In [5]:
# List all table names in the db

sql_query = '''
    SELECT table_name 
    FROM information_schema.tables
    WHERE table_schema='public'
    ORDER BY table_name
'''

data = pd.read_sql_query(sql_query, conn)
data.head()

  table_name
0  customers
1   employee

# execute query to create a table
cur.execute("""
CREATE TABLE employee
(
    ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    EMAIL TEXT NOT NULL
)
"""
)

# commit the changes
conn.commit()
print('Table created successfully')

In [6]:
# List all table names in the db

sql_query = '''
    SELECT * FROM employee
'''

data = pd.read_sql_query(sql_query, conn)
data.head()

Empty DataFrame
Columns: [id, name, email]
Index: []

## 2. Insert data into the table using Python

In [7]:
cur.execute("""
    INSERT INTO employee (ID,NAME,EMAIL) VALUES
    (1, 'Alan Walker', 'awalker@gmail.com'),
    (2, 'Steve Jobs', 'sjobs@gmail.com')
""")
conn.commit()

In [8]:
sql_query = """
    SELECT * FROM employee
"""

data = pd.read_sql_query(sql_query, conn)
data.head()

   id         name              email
0   1  Alan Walker  awalker@gmail.com
1   2   Steve Jobs    sjobs@gmail.com

## 3. Update data in the db

In [11]:
cur.execute("""
    UPDATE employee SET EMAIL='updated@gmail.com'
    WHERE ID = 1
"""
)
conn.commit()

In [12]:
sql_query = """
    SELECT * FROM employee
"""

data = pd.read_sql_query(sql_query, conn)
data.head()

   id         name              email
0   2   Steve Jobs    sjobs@gmail.com
1   1  Alan Walker  updated@gmail.com

## 4. Delete data from db

In [13]:
cur.execute('''
    DELETE FROM employee WHERE ID=1
''')
conn.commit()

In [14]:
sql_query = """
    SELECT * FROM employee
"""

data = pd.read_sql_query(sql_query, conn)
data.head()

   id        name            email
0   2  Steve Jobs  sjobs@gmail.com

## 5. Drop a table from db

In [15]:
cur.execute('''
    DROP TABLE employee
''')
conn.commit()

In [16]:
sql_query = '''
SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'public'
ORDER BY table_name;
'''
data = pd.read_sql_query(sql_query, conn)
data.head()

  table_name
0  customers

In [17]:
# Close the connection
conn.close()

## SQLAlchemy

In [18]:
from sqlalchemy import create_engine
engine = create_engine('postgresql+psycopg2://'+DB_USER+':'+DB_PASS+'@'+DB_HOST+':'+DB_PORT+'/'+DB_NAME)
conn = engine.connect() 
output = conn.execute("SELECT * FROM customers")
print(output.fetchall())

sql_query = '''
SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'public'
ORDER BY table_name;
'''
data = pd.read_sql_query(sql_query, conn)
data.head()

[(1, 'Alice Smith', 'alice@example.com', '555-1234'), (2, 'Bob Johnson', 'bob@example.com', '555-5678'), (3, 'Charlie Brown', 'charlie@example.com', None)]

  table_name
0  customers